tylertms/dspic33e-sim/conformance/spi.c
#include <inttypes.h>
#include <stdbool.h>
#include <stdint.h>
#include <stdio.h>

#include "device.h"
#include "dspic33.h"
#include "sfr_side_effect_coverage.h"

static const SfrSideEffectCoverage spi_sfr_side_effect_coverage[] = {
    {0x0240u, 0x0040u}, {0x0248u, 0xffffu}, {0x0260u, 0x0040u}, {0x0268u, 0xffffu},
    {0x02a0u, 0x0040u}, {0x02a8u, 0xffffu}, {0x02c0u, 0x0040u}, {0x02c8u, 0xffffu},
};

typedef struct {
    uint32_t cases;
    uint32_t passed;
    uint32_t failed;
} SpiConformance;

static const uint16_t bases[DSPIC33_SPI_COUNT] = {0x0240u, 0x0260u, 0x02a0u, 0x02c0u};
static const uint8_t irqs[DSPIC33_SPI_COUNT] = {10u, 33u, 91u, 123u};
static const uint8_t error_irqs[DSPIC33_SPI_COUNT] = {9u, 32u, 90u, 122u};
static const uint8_t requests[DSPIC33_SPI_COUNT] = {10u, 33u, 91u, 123u};

static void expect(SpiConformance* state, bool condition, const char* name) {
    state->cases++;
    if (condition) {
        state->passed++;
    } else {
        state->failed++;
        printf("[spi-failed] %s\n", name);
    }
}

static bool interrupt_flag(Dspic33* cpu, uint8_t irq) {
    uint16_t address = (uint16_t)(0x0800u + (irq / 16u) * 2u);
    return (dspic33_read_word(cpu, address) & (uint16_t)(1u << (irq % 16u))) != 0u;
}

static void clear_interrupt(Dspic33* cpu, uint8_t irq) {
    uint16_t address = (uint16_t)(0x0800u + (irq / 16u) * 2u);
    dspic33_write_word(
        cpu, address,
        (uint16_t)(dspic33_read_word(cpu, address) & ~(uint16_t)(1u << (irq % 16u))));
}

static bool transfer_interrupt_after_cycle(Dspic33* cpu, uint8_t irq) {
    return !interrupt_flag(cpu, irq) && dspic33_device_advance(cpu, 1u) &&
           interrupt_flag(cpu, irq);
}

static uint64_t transfer_cycles(uint16_t control) {
    static const uint8_t primary[] = {64u, 16u, 4u, 1u};
    uint8_t secondary = (uint8_t)(8u - ((control >> 2u) & 7u));
    uint8_t bits = (control & 0x0400u) != 0u ? 16u : 8u;
    return (uint64_t)bits * primary[control & 3u] * secondary;
}

static void configure_spi(Dspic33* cpu, uint8_t channel, uint16_t control,
                          uint16_t control2, uint8_t interrupt_mode) {
    uint16_t base = bases[channel];
    dspic33_write_word(cpu, base, 0u);
    dspic33_write_word(cpu, (uint16_t)(base + 2u), control);
    dspic33_write_word(cpu, (uint16_t)(base + 4u), control2);
    dspic33_write_word(cpu, base,
                       (uint16_t)(0x8000u | ((uint16_t)interrupt_mode << 2u)));
}

static bool drive_pps_spi_word(Dspic33* cpu, uint16_t value, uint8_t width,
                               uint16_t data_mask, uint16_t clock_mask) {
    uint8_t index;
    for (index = 0u; index < width; index++) {
        uint16_t data =
            (value & (uint16_t)(1u << (width - index - 1u))) != 0u ? data_mask : 0u;
        if (!dspic33_gpio_drive(cpu, 3u, data, data_mask) ||
            !dspic33_gpio_drive(cpu, 3u, clock_mask, clock_mask) ||
            !dspic33_gpio_drive(cpu, 3u, 0u, clock_mask)) {
            return false;
        }
    }
    return true;
}

static uint16_t dma_base(uint8_t channel) {
    return (uint16_t)(0x0b00u + channel * 0x10u);
}

static void configure_dma(Dspic33* cpu, uint8_t channel, uint16_t control,
                          uint8_t request, uint32_t memory, uint16_t pad,
                          uint16_t count) {
    uint16_t base = dma_base(channel);
    dspic33_write_word(cpu, base, 0u);
    dspic33_write_word(cpu, (uint16_t)(base + 2u), request);
    dspic33_write_word(cpu, (uint16_t)(base + 4u), (uint16_t)memory);
    dspic33_write_word(cpu, (uint16_t)(base + 6u), (uint16_t)(memory >> 16u));
    dspic33_write_word(cpu, (uint16_t)(base + 0x0cu), pad);
    dspic33_write_word(cpu, (uint16_t)(base + 0x0eu), count);
    dspic33_write_word(cpu, base, (uint16_t)(control | 0x8000u));
}

static void register_cases(SpiConformance* state, Dspic33* cpu) {
    uint8_t channel;
    dspic33_reset(cpu, 0u);
    for (channel = 0u; channel < DSPIC33_SPI_COUNT; channel++) {
        uint16_t base = bases[channel];
        expect(state, dspic33_read_word(cpu, base) == 0u, "status reset");
        expect(state, dspic33_read_word(cpu, (uint16_t)(base + 2u)) == 0u,
               "control one reset");
        expect(state, dspic33_read_word(cpu, (uint16_t)(base + 4u)) == 0u,
               "control two reset");
        expect(state, dspic33_read_word(cpu, (uint16_t)(base + 8u)) == 0u,
               "buffer reset");
        dspic33_write_word(cpu, base, 0xffffu);
        expect(state, dspic33_read_word(cpu, base) == 0xa01cu, "status mask");
        dspic33_write_word(cpu, (uint16_t)(base + 2u), 0xffffu);
        expect(state, dspic33_read_word(cpu, (uint16_t)(base + 2u)) == 0x1fffu,
               "control one mask");
        dspic33_write_word(cpu, (uint16_t)(base + 4u), 0xffffu);
        expect(state, dspic33_read_word(cpu, (uint16_t)(base + 4u)) == 0xe003u,
               "control two mask");
        dspic33_write_word(cpu, (uint16_t)(base + 2u), 0x0200u);
        expect(state, dspic33_read_word(cpu, (uint16_t)(base + 2u)) == 0u,
               "slave sample phase forced clear");
        dspic33_write_word(cpu, (uint16_t)(base + 2u), 0x0220u);
        expect(state, dspic33_read_word(cpu, (uint16_t)(base + 2u)) == 0x0220u,
               "master sample phase writable");
    }
}

static void split_buffer_cases(SpiConformance* state, Dspic33* cpu) {
    uint8_t channel;
    for (channel = 0u; channel < DSPIC33_SPI_COUNT; channel++) {
        uint16_t base = bases[channel];
        uint16_t control = 0x043bu;
        uint16_t first_transmit = (uint16_t)(0xa100u + channel);
        uint16_t second_transmit = (uint16_t)(0xc200u + channel);
        uint16_t received = (uint16_t)(0x5b00u + channel);
        uint64_t cycles = transfer_cycles(control);
        bool scheduled;
        bool advanced;

        dspic33_reset(cpu, 0u);
        configure_spi(cpu, channel, control, 0u, 0u);
        scheduled = dspic33_spi_receive(cpu, channel, received, cycles);
        dspic33_write_word(cpu, (uint16_t)(base + 8u), first_transmit);
        expect(state, scheduled && dspic33_read_word(cpu, (uint16_t)(base + 8u)) == 0u,
               "accepted transmit is not receive data");
        expect(state,
               cpu->io.spi_shift[channel] == first_transmit &&
                   cpu->io.spi_tx[channel].count == 2u &&
                   cpu->io.spi_tx[channel].bytes[0] == (uint8_t)first_transmit &&
                   cpu->io.spi_tx[channel].bytes[1] == (uint8_t)(first_transmit >> 8u),
               "accepted transmit enters transmit path");
        advanced = dspic33_device_advance(cpu, cycles);
        dspic33_write_word(cpu, (uint16_t)(base + 8u), second_transmit);
        expect(state,
               advanced && dspic33_read_word(cpu, (uint16_t)(base + 8u)) == received,
               "queued receive survives transmit write");
        expect(state,
               cpu->io.spi_rx_fifo[channel].count == 0u &&
                   (dspic33_read_word(cpu, base) & 0x0001u) == 0u &&
                   cpu->io.spi_shift[channel] == second_transmit &&
                   cpu->io.spi_tx[channel].count == 4u,
               "receive drain preserves next transmit");
    }
}

static void transmit_output_cases(SpiConformance* state, Dspic33* cpu) {
    uint8_t channel;
    uint8_t value;
    for (channel = 0u; channel < DSPIC33_SPI_COUNT; channel++) {
        uint16_t base = bases[channel];
        uint16_t transmitted = (uint16_t)(0xa500u + channel);
        dspic33_reset(cpu, 0u);
        configure_spi(cpu, channel, 0x043bu, 0u, 0u);
        dspic33_write_word(cpu, (uint16_t)(base + 8u), transmitted);
        expect(state,
               dspic33_spi_transmit(cpu, channel, &value) &&
                   value == (uint8_t)transmitted,
               "transmit output low byte");
        expect(state,
               dspic33_spi_transmit(cpu, channel, &value) &&
                   value == (uint8_t)(transmitted >> 8u) &&
                   !dspic33_spi_transmit(cpu, channel, &value),
               "transmit output high byte and empty state");
    }
    expect(state,
           !dspic33_spi_transmit(cpu, DSPIC33_SPI_COUNT, &value) &&
               !dspic33_spi_transmit(cpu, 0u, NULL),
           "transmit output rejects invalid requests");
}

