tylertms/dspic33e-sim/conformance/spi.c
static void master_input_cases(SpiConformance* state, Dspic33* cpu, Dspic33* copy) {
    static const uint16_t input_registers[DSPIC33_SPI_COUNT] = {0x06c8u, 0u, 0x06dau,
                                                                0x06deu};
    uint8_t channel;
    for (channel = 0u; channel < DSPIC33_SPI_COUNT; channel++) {
        uint8_t mode16;
        for (mode16 = 0u; mode16 < 2u; mode16++) {
            uint8_t sample_end;
            for (sample_end = 0u; sample_end < 2u; sample_end++) {
                uint16_t control = (uint16_t)(0x003bu | ((uint16_t)mode16 << 10u) |
                                              ((uint16_t)sample_end << 9u));
                uint16_t received = mode16 != 0u ? 0xa55au : 0x005au;
                uint8_t width = mode16 != 0u ? 16u : 8u;

                dspic33_reset(cpu, 0u);
                if (input_registers[channel] != 0u) {
                    dspic33_write_word(
                        cpu, 0x0e3eu,
                        (uint16_t)(dspic33_read_word(cpu, 0x0e3eu) & ~1u));
                    dspic33_write_word(cpu, input_registers[channel], 64u);
                }
                configure_spi(cpu, channel, control, 0u, 0u);
                set_master_input(cpu, channel, false);
                dspic33_write_word(cpu, (uint16_t)(bases[channel] + 8u), 0xffffu);
                drive_master_input(cpu, channel, received, width);
                expect(state,
                       transfer_interrupt_after_cycle(cpu, irqs[channel]) &&
                           dspic33_read_word(cpu, (uint16_t)(bases[channel] + 8u)) ==
                               received,
                       "master samples physical serial input");
            }
        }
    }

    for (uint8_t sample_end = 0u; sample_end < 2u; sample_end++) {
        dspic33_reset(cpu, 0u);
        configure_spi(cpu, 1u, (uint16_t)(0x003bu | ((uint16_t)sample_end << 9u)), 0u,
                      0u);
        set_master_input(cpu, 1u, true);
        dspic33_write_word(cpu, 0x0268u, 0xffu);
        dspic33_device_advance(cpu, 1u);
        set_master_input(cpu, 1u, false);
        dspic33_device_advance(cpu, 1u);
        drive_master_input(cpu, 1u, 0u, 7u);
        expect(state,
               dspic33_read_word(cpu, 0x0268u) == (sample_end == 0u ? 0x80u : 0u),
               "master sample phase selects middle or end of data period");
    }

    dspic33_reset(cpu, 0u);
    configure_spi(cpu, 0u, 0x003bu, 0u, 0u);
    dspic33_write_word(cpu, 0x0248u, 0xa5u);
    dspic33_device_advance(cpu, 16u);
    expect(state, dspic33_read_word(cpu, 0x0248u) == 0xa5u,
           "unmapped master retains logical transport loopback");

    dspic33_reset(cpu, 0u);
    configure_spi(cpu, 1u, 0x083bu, 0u, 0u);
    set_master_input(cpu, 1u, false);
    dspic33_write_word(cpu, 0x0268u, 0xffu);
    drive_master_input(cpu, 1u, 0xa5u, 8u);
    expect(state,
           dspic33_read_word(cpu, 0x0268u) == 0xa5u &&
               !dspic33_spi_data_output(cpu, 1u, &(bool){false}),
           "receive-only master samples input with serial output released");

    dspic33_reset(cpu, 0u);
    configure_spi(cpu, 1u, 0x043bu, 0u, 0u);
    set_master_input(cpu, 1u, false);
    dspic33_write_word(cpu, 0x0268u, 0xffffu);
    drive_master_input(cpu, 1u, 0xa5u, 8u);
    expect(state, dspic33_copy(copy, cpu), "copy partial master physical input");
    drive_master_input(cpu, 1u, 0x5au, 8u);
    drive_master_input(copy, 1u, 0xc3u, 8u);
    expect(state, dspic33_read_word(cpu, 0x0268u) == 0xa55au,
           "source master physical input completes independently");
    expect(state, dspic33_read_word(copy, 0x0268u) == 0xa5c3u,
           "copied master physical input completes independently");

    dspic33_reset(cpu, 0u);
    dspic33_write_word(cpu, 0x06c8u, 70u);
    dspic33_write_word(cpu, 0x0e3eu,
                       (uint16_t)(dspic33_read_word(cpu, 0x0e3eu) | 0x0040u));
    configure_spi(cpu, 0u, 0x003bu, 0u, 0u);
    dspic33_write_word(cpu, 0x0248u, 0xffu);
    for (uint8_t index = 0u; index < 8u; index++) {
        dspic33_gpio_drive(cpu, 3u, 0x0040u, 0x0040u);
        dspic33_device_advance(cpu, 2u);
    }
    expect(state, dspic33_read_word(cpu, 0x0248u) == 0u,
           "analog PPS data pin suppresses master input");

    dspic33_reset(cpu, 0u);
    dspic33_write_word(cpu, 0x0e3eu, (uint16_t)(dspic33_read_word(cpu, 0x0e3eu) & ~3u));
    dspic33_write_word(cpu, 0x06c8u, 64u);
    configure_spi(cpu, 0u, 0x003bu, 0u, 0u);
    dspic33_write_word(cpu, 0x0248u, 0xffu);
    for (uint8_t index = 0u; index < 4u; index++) {
        bool high = (0xa5u & (uint16_t)(1u << (7u - index))) != 0u;
        dspic33_gpio_drive(cpu, 3u, high ? 1u : 0u, 1u);
        dspic33_device_advance(cpu, 2u);
    }
    dspic33_write_word(cpu, 0x06c8u, 65u);
    for (uint8_t index = 4u; index < 8u; index++) {
        bool high = (0xa5u & (uint16_t)(1u << (7u - index))) != 0u;
        dspic33_gpio_drive(cpu, 3u, high ? 2u : 0u, 2u);
        dspic33_device_advance(cpu, 2u);
    }
    expect(state, dspic33_read_word(cpu, 0x0248u) == 0xa5u,
           "live PPS remap changes master input source");

    dspic33_reset(cpu, 0u);
    configure_spi(cpu, 1u, 0x003bu, 0u, 0u);
    set_master_input(cpu, 1u, false);
    cpu->device_cycles = UINT64_MAX;
    dspic33_write_word(cpu, 0x0268u, 0xffu);
    expect(state,
           cpu->stop_reason == DSPIC33_EVENT_QUEUE_ERROR && cpu->events.count == 0u &&
               (cpu->io.spi_busy & 2u) == 0u,
           "master input scheduling failure aborts transfer");

    dspic33_reset(cpu, 0u);
    set_master_input(cpu, 1u, true);
    dspic33_load_program_word(cpu, 0u, 0xfe0000u);
    expect(state,
           dspic33_step(cpu) == DSPIC33_RUNNING && cpu->software_reset_count == 1u &&
               (cpu->io.spi_pin_input_enabled & 2u) != 0u &&
               (cpu->io.spi_pin_data_high & 2u) != 0u,
           "warm reset preserves dedicated master input level");
    configure_spi(cpu, 1u, 0x003bu, 0u, 0u);
    dspic33_write_word(cpu, 0x0268u, 0u);
    expect(state,
           dspic33_device_advance(cpu, 16u) && dspic33_read_word(cpu, 0x0268u) == 0xffu,
           "retained master input remains observable after warm reset");
}

static void timing_matrix_cases(SpiConformance* state, Dspic33* cpu) {
    uint8_t channel;
    uint8_t mode16;
    uint8_t primary;
    uint8_t secondary;
    for (channel = 0u; channel < DSPIC33_SPI_COUNT; channel++) {
        for (mode16 = 0u; mode16 < 2u; mode16++) {
            for (primary = 0u; primary < 4u; primary++) {
                for (secondary = 0u; secondary < 8u; secondary++) {
                    uint16_t control;
                    uint16_t sent;
                    uint16_t received;
                    uint64_t cycles;
                    if (primary == 3u && secondary == 7u) {
                        continue;
                    }
                    control =
                        (uint16_t)(0x0020u | primary | ((uint16_t)secondary << 2u) |
                                   (mode16 != 0u ? 0x0400u : 0u));
                    sent = (uint16_t)(0x8100u | (channel << 4u) | (primary << 2u) |
                                      (secondary & 3u));
                    received = (uint16_t)(0x5a00u | (secondary << 4u) | primary);
                    cycles = transfer_cycles(control);
                    dspic33_reset(cpu, 0u);
                    configure_spi(cpu, channel, control, 0u, 0u);
                    expect(state, dspic33_spi_receive(cpu, channel, received, cycles),
                           "schedule master response matrix");
                    dspic33_write_word(cpu, (uint16_t)(bases[channel] + 8u), sent);
                    expect(state,
                           (dspic33_read_word(cpu, bases[channel]) & 0x0080u) == 0u,
                           "matrix shift register active");
                    expect(state, dspic33_device_advance(cpu, cycles - 1u),
                           "matrix advance before completion");
                    expect(state,
                           (dspic33_read_word(cpu, bases[channel]) & 0x0001u) == 0u,
                           "matrix not complete early");
                    expect(state, dspic33_device_advance(cpu, 1u),
                           "matrix completion advance");
                    expect(state,
                           (dspic33_read_word(cpu, bases[channel]) & 0x0001u) != 0u,
                           "matrix receive flag");
                    expect(
                        state,
                        dspic33_read_word(cpu, (uint16_t)(bases[channel] + 8u)) ==
                            (mode16 != 0u ? received : (uint16_t)(received & 0x00ffu)),
                        "matrix received value");
                    expect(state, transfer_interrupt_after_cycle(cpu, irqs[channel]),
                           "matrix transfer interrupt");
                }
            }
        }
    }
}

static void standard_buffer_cases(SpiConformance* state, Dspic33* cpu) {
    uint8_t channel;
    for (channel = 0u; channel < DSPIC33_SPI_COUNT; channel++) {
        uint16_t base = bases[channel];
        uint16_t control = 0x043bu;
        uint64_t cycles = transfer_cycles(control);
        dspic33_reset(cpu, 0u);
        configure_spi(cpu, channel, control, 0u, 0u);
        expect(state,
               dspic33_spi_receive(cpu, channel, 0x1111u, cycles) &&
                   dspic33_spi_receive(cpu, channel, 0x2222u, cycles * 2u),
               "queue standard responses");
        dspic33_write_word(cpu, (uint16_t)(base + 8u), 0xaaaau);
        dspic33_write_word(cpu, (uint16_t)(base + 8u), 0xbbbbu);
        expect(state, (dspic33_read_word(cpu, base) & 0x0002u) != 0u,
               "standard transmit buffer full");
        dspic33_write_word(cpu, (uint16_t)(base + 8u), 0xccccu);
        expect(state, cpu->io.spi_tx_fifo[channel].count == 1u,
               "standard full write ignored");
        expect(state, dspic33_device_advance(cpu, cycles), "standard first completion");
        expect(state, (dspic33_read_word(cpu, base) & 0x0002u) == 0u,
               "standard queued word moved to shift");
        expect(state, dspic33_read_word(cpu, (uint16_t)(base + 8u)) == 0x1111u,
               "standard first response order");
        expect(state, transfer_interrupt_after_cycle(cpu, irqs[channel]),
               "standard first interrupt follows one-cycle latency");
        clear_interrupt(cpu, irqs[channel]);
        expect(state, dspic33_device_advance(cpu, cycles - 1u),
               "standard second completion");
        expect(state, dspic33_read_word(cpu, (uint16_t)(base + 8u)) == 0x2222u,
               "standard second response order");
        expect(state, transfer_interrupt_after_cycle(cpu, irqs[channel]),
               "standard second interrupt");

        dspic33_reset(cpu, 0u);
        configure_spi(cpu, channel, 0u, 0u, 0u);
        expect(state,
               dspic33_spi_receive(cpu, channel, 0x0031u, 1u) &&
                   dspic33_spi_receive(cpu, channel, 0x0032u, 2u),
               "queue standard slave overflow");
        expect(state, dspic33_device_advance(cpu, 2u),
               "standard slave overflow advance");
        expect(state, (dspic33_read_word(cpu, base) & 0x0041u) == 0x0041u,
               "standard overflow flags");
        expect(state, interrupt_flag(cpu, error_irqs[channel]),
               "standard overflow error interrupt");
        dspic33_write_word(cpu, base,
                           (uint16_t)(dspic33_read_word(cpu, base) & ~0x0040u));
        expect(state, (dspic33_read_word(cpu, base) & 0x0040u) == 0u,
               "standard overflow software clear");
        expect(state, dspic33_read_word(cpu, (uint16_t)(base + 8u)) == 0x0031u,
               "standard overflow preserves unread value");
        expect(state,
               dspic33_spi_receive(cpu, channel, 0x0033u, 1u) &&
                   dspic33_device_advance(cpu, 1u),
               "standard receive resumes after clear");
        expect(state, dspic33_read_word(cpu, (uint16_t)(base + 8u)) == 0x0033u,
               "standard recovered receive value");
    }
}

static void enhanced_fifo_cases(SpiConformance* state, Dspic33* cpu) {
    uint8_t channel;
    for (channel = 0u; channel < DSPIC33_SPI_COUNT; channel++) {
        uint16_t base = bases[channel];
        uint16_t control = 0x043bu;
        uint64_t cycles = transfer_cycles(control);
        uint8_t index;
        dspic33_reset(cpu, 0u);
        configure_spi(cpu, channel, control, 1u, 5u);
        for (index = 0u; index < 9u; index++) {
            dspic33_write_word(cpu, (uint16_t)(base + 8u), (uint16_t)(0x1000u + index));
        }
        expect(state, cpu->io.spi_tx_fifo[channel].count == 8u,
               "enhanced eight pending words");
        expect(state, (dspic33_read_word(cpu, base) & 0x0702u) == 0x0702u,
               "enhanced full count encoding");
        dspic33_write_word(cpu, (uint16_t)(base + 8u), 0xdeadu);
        expect(state, cpu->io.spi_tx_fifo[channel].count == 8u,
               "enhanced full write ignored");
        for (index = 0u; index < 9u; index++) {
            expect(state, dspic33_device_advance(cpu, cycles),
                   "enhanced transmit completion");
            expect(state,
                   dspic33_read_word(cpu, (uint16_t)(base + 8u)) ==
                       (uint16_t)(0x1000u + index),
                   "enhanced transmit receive order");
        }
        expect(state, (dspic33_read_word(cpu, base) & 0x00a2u) == 0x00a0u,
               "enhanced queues empty");
        expect(state, interrupt_flag(cpu, irqs[channel]),
               "enhanced final completion interrupt");

        dspic33_reset(cpu, 0u);
        configure_spi(cpu, channel, 0x0400u, 1u, 3u);
        for (index = 0u; index < 8u; index++) {
            expect(state,
                   dspic33_spi_receive(cpu, channel, (uint16_t)(0x3000u + index), 1u) &&
                       dspic33_device_advance(cpu, 1u),
                   "enhanced slave receive fill");
        }
        expect(state, cpu->io.spi_rx_fifo[channel].count == 8u,
               "enhanced receive depth");
        expect(state, (dspic33_read_word(cpu, base) & 0x0721u) == 0x0701u,
               "enhanced receive full status");
        expect(state, interrupt_flag(cpu, irqs[channel]),
               "enhanced receive full interrupt");
        clear_interrupt(cpu, irqs[channel]);
        expect(state,
               dspic33_spi_receive(cpu, channel, 0x3fffu, 1u) &&
                   dspic33_device_advance(cpu, 1u),
               "enhanced overflow advance");
        expect(state, (dspic33_read_word(cpu, base) & 0x0040u) != 0u,
               "enhanced overflow flag");
        expect(state, interrupt_flag(cpu, error_irqs[channel]),
               "enhanced overflow error interrupt");
        expect(state,
               dspic33_spi_receive(cpu, channel, 0x3eeeu, 1u) &&
                   dspic33_device_advance(cpu, 1u),
               "enhanced overflow blocks receive");
        expect(state, cpu->io.spi_rx_fifo[channel].count == 8u,
               "enhanced blocked receive preserves depth");
        dspic33_write_word(cpu, base,
                           (uint16_t)(dspic33_read_word(cpu, base) & ~0x0040u));
        expect(state, (dspic33_read_word(cpu, base) & 0x0040u) == 0u,
               "enhanced overflow software clear");
        expect(state, cpu->io.spi_rx_fifo[channel].count == 8u,
               "enhanced clear preserves unread words");
        expect(state, dspic33_read_word(cpu, (uint16_t)(base + 8u)) == 0x3000u,
               "enhanced first preserved word");
        expect(state, cpu->io.spi_rx_fifo[channel].count == 7u,
               "enhanced read frees receive slot");
        expect(state,
               dspic33_spi_receive(cpu, channel, 0x3dddu, 1u) &&
                   dspic33_device_advance(cpu, 1u),
               "enhanced receive resumes after clear");
        expect(state, (dspic33_read_word(cpu, base) & 0x0040u) == 0u,
               "enhanced recovered receive avoids overflow");
        expect(state, cpu->io.spi_rx_fifo[channel].count == 8u,
               "enhanced recovered receive fills slot");
        for (index = 1u; index < 8u; index++) {
            expect(state,
                   dspic33_read_word(cpu, (uint16_t)(base + 8u)) ==
                       (uint16_t)(0x3000u + index),
                   "enhanced receive read order");
        }
        expect(state, dspic33_read_word(cpu, (uint16_t)(base + 8u)) == 0x3dddu,
               "enhanced recovered receive tail");
        expect(state, (dspic33_read_word(cpu, base) & 0x0021u) == 0x0020u,
               "enhanced receive empty status");
    }
}

static void interrupt_mode_cases(SpiConformance* state, Dspic33* cpu) {
    uint16_t base = bases[0];
    uint16_t master = 0x043bu;
    uint64_t cycles = transfer_cycles(master);
    uint8_t index;

    dspic33_reset(cpu, 0u);
    configure_spi(cpu, 0u, master, 1u, 7u);
    dspic33_write_word(cpu, (uint16_t)(base + 8u), 0x1000u);
    for (index = 0u; index < 7u; index++) {
        dspic33_write_word(cpu, (uint16_t)(base + 8u), (uint16_t)(0x1001u + index));
    }
    expect(state, !interrupt_flag(cpu, irqs[0]), "mode seven not early");
    dspic33_write_word(cpu, (uint16_t)(base + 8u), 0x1008u);
    expect(state, interrupt_flag(cpu, irqs[0]), "mode seven transmit full");

    dspic33_reset(cpu, 0u);
    configure_spi(cpu, 0u, master, 1u, 6u);
    dspic33_write_word(cpu, (uint16_t)(base + 8u), 0x2000u);
    expect(state, interrupt_flag(cpu, irqs[0]), "mode six transmit fifo empty");

    dspic33_reset(cpu, 0u);
    configure_spi(cpu, 0u, master, 1u, 5u);
    dspic33_write_word(cpu, (uint16_t)(base + 8u), 0x3000u);
    expect(state, !interrupt_flag(cpu, irqs[0]), "mode five not early");
    expect(state, dspic33_device_advance(cpu, cycles), "mode five completion advance");
    expect(state, interrupt_flag(cpu, irqs[0]), "mode five transfer complete");

    dspic33_reset(cpu, 0u);
    configure_spi(cpu, 0u, master, 1u, 4u);
    for (index = 0u; index < 9u; index++) {
        dspic33_write_word(cpu, (uint16_t)(base + 8u), (uint16_t)(0x4000u + index));
    }
    expect(state, !interrupt_flag(cpu, irqs[0]), "mode four not early");
    expect(state, dspic33_device_advance(cpu, cycles), "mode four opening advance");
    expect(state, interrupt_flag(cpu, irqs[0]), "mode four one opening");

    dspic33_reset(cpu, 0u);
    configure_spi(cpu, 0u, 0x0400u, 1u, 1u);
    expect(state,
           dspic33_spi_receive(cpu, 0u, 0x5000u, 1u) && dspic33_device_advance(cpu, 1u),
           "mode one receive advance");
    expect(state, interrupt_flag(cpu, irqs[0]), "mode one data received");

    dspic33_reset(cpu, 0u);
    configure_spi(cpu, 0u, 0x0400u, 1u, 2u);
    for (index = 0u; index < 5u; index++) {
        expect(state,
               dspic33_spi_receive(cpu, 0u, index, 1u) &&
                   dspic33_device_advance(cpu, 1u),
               "mode two below threshold advance");
    }
    expect(state, !interrupt_flag(cpu, irqs[0]), "mode two below threshold");
    expect(state,
           dspic33_spi_receive(cpu, 0u, 5u, 1u) && dspic33_device_advance(cpu, 1u),
           "mode two threshold advance");
    expect(state, interrupt_flag(cpu, irqs[0]), "mode two three quarters full");

    dspic33_reset(cpu, 0u);
    configure_spi(cpu, 0u, 0x0400u, 1u, 3u);
    for (index = 0u; index < 7u; index++) {
        expect(state,
               dspic33_spi_receive(cpu, 0u, index, 1u) &&
                   dspic33_device_advance(cpu, 1u),
               "mode three below full advance");
    }
    expect(state, !interrupt_flag(cpu, irqs[0]), "mode three below full");
    expect(state,
           dspic33_spi_receive(cpu, 0u, 7u, 1u) && dspic33_device_advance(cpu, 1u),
           "mode three full advance");
    expect(state, interrupt_flag(cpu, irqs[0]), "mode three receive full");

    dspic33_reset(cpu, 0u);
    configure_spi(cpu, 0u, 0x0400u, 1u, 0u);
    expect(state,
           dspic33_spi_receive(cpu, 0u, 0x6000u, 1u) && dspic33_device_advance(cpu, 1u),
           "mode zero receive advance");
    expect(state, !interrupt_flag(cpu, irqs[0]), "mode zero not on receive");
    expect(state, dspic33_read_word(cpu, (uint16_t)(base + 8u)) == 0x6000u,
           "mode zero read value");
    expect(state, interrupt_flag(cpu, irqs[0]), "mode zero receive empty");
}

