tylertms/dspic33e-sim/conformance/spi.c
                dspic33_reset(cpu, 0u);
                configure_spi(cpu, channel, control, control2, 0u);
                dspic33_spi_pin_input(cpu, channel, false, false, !active);
                dspic33_write_word(cpu, (uint16_t)(bases[channel] + 8u), transmitted);
                expect(state,
                       (cpu->io.spi_busy & (uint8_t)(1u << channel)) == 0u &&
                           cpu->io.spi_tx_fifo[channel].count == 1u &&
                           dspic33_spi_clock_output(cpu, channel, &clock),
                       "master framed slave waits with free-running clock");
                dspic33_spi_pin_input(cpu, channel, false, false, active);
                expect(state,
                       dspic33_device_advance(cpu, 1u) &&
                           (cpu->io.spi_busy & (uint8_t)(1u << channel)) == 0u,
                       "master framed slave samples pulse before transmitting");
                dspic33_spi_pin_input(cpu, channel, false, false, !active);
                expect(state,
                       dspic33_device_advance(cpu, 1u) &&
                           (cpu->io.spi_busy & (uint8_t)(1u << channel)) != 0u,
                       "sampled frame pulse starts transfer on next transmit edge");
                expect(state,
                       dspic33_device_advance(cpu, cycles) &&
                           dspic33_read_word(cpu, (uint16_t)(bases[channel] + 8u)) ==
                               0u &&
                           !interrupt_flag(cpu, irqs[channel]),
                       "master framed slave completes after full data frame");
                expect(state, transfer_interrupt_after_cycle(cpu, irqs[channel]),
                       "master framed slave retains interrupt latency");
            }

            dspic33_reset(cpu, 0u);
            configure_spi(cpu, channel, 0x003bu,
                          (uint16_t)(0xc000u | ((uint16_t)polarity << 13u)), 0u);
            dspic33_spi_pin_input(cpu, channel, false, false, !active);
            dspic33_write_word(cpu, (uint16_t)(bases[channel] + 8u), 0x00a5u);
            dspic33_spi_pin_input(cpu, channel, false, false, active);
            dspic33_spi_pin_input(cpu, channel, false, false, !active);
            expect(state,
                   dspic33_device_advance(cpu, 2u) &&
                       (cpu->io.spi_busy & (uint8_t)(1u << channel)) == 0u &&
                       cpu->io.spi_tx_fifo[channel].count == 1u,
                   "frame pulse released before sample edge is ignored");
        }
    }
}

static void clock_and_power_cases(SpiConformance* state, Dspic33* cpu) {
    uint8_t channel;
    for (channel = 0u; channel < DSPIC33_SPI_COUNT; channel++) {
        uint16_t base = bases[channel];
        uint16_t control = 0x143bu;
        uint64_t cycles = transfer_cycles(control);
        dspic33_reset(cpu, 0u);
        configure_spi(cpu, channel, control, 0u, 0u);
        dspic33_write_word(cpu, (uint16_t)(base + 8u), 0x1111u);
        expect(state, cpu->events.count == 0u, "disabled clock does not schedule");
        dspic33_write_word(cpu, (uint16_t)(base + 2u), 0x043bu);
        expect(state, cpu->events.count == 1u, "clock enable resumes transfer");
        expect(state, dspic33_device_advance(cpu, cycles),
               "resumed clock completion advance");
        expect(state, dspic33_read_word(cpu, (uint16_t)(base + 8u)) == 0x1111u,
               "resumed clock transfer value");

        dspic33_reset(cpu, 0u);
        configure_spi(cpu, channel, 0x043bu, 0u, 0u);
        dspic33_write_word(cpu, (uint16_t)(base + 8u), 0x2222u);
        cpu->power_state = DSPIC33_POWER_SLEEP;
        expect(state, dspic33_device_advance(cpu, cycles),
               "master sleep transfer advance");
        expect(state,
               (dspic33_read_word(cpu, base) & 1u) == 0u &&
                   (cpu->io.spi_busy & (uint8_t)(1u << channel)) == 0u,
               "master sleep aborts transfer");

        dspic33_reset(cpu, 0u);
        configure_spi(cpu, channel, 0x0400u, 0u, 0u);
        cpu->power_state = DSPIC33_POWER_SLEEP;
        expect(state,
               dspic33_spi_receive(cpu, channel, 0x3333u, 1u) &&
                   dspic33_device_advance(cpu, 1u),
               "slave sleep transaction advance");
        expect(state, dspic33_read_word(cpu, (uint16_t)(base + 8u)) == 0x3333u,
               "slave sleep completes transfer");

        dspic33_reset(cpu, 0u);
        configure_spi(cpu, channel, 0x043bu, 0u, 0u);
        dspic33_write_word(cpu, (uint16_t)(base + 8u), 0x4444u);
        cpu->power_state = DSPIC33_POWER_IDLE;
        expect(state, dspic33_device_advance(cpu, cycles),
               "master idle running advance");
        expect(state, (dspic33_read_word(cpu, base) & 1u) != 0u,
               "master idle continues by default");

        dspic33_reset(cpu, 0u);
        configure_spi(cpu, channel, 0x043bu, 0u, 0u);
        dspic33_write_word(cpu, base, 0xa000u);
        dspic33_write_word(cpu, (uint16_t)(base + 8u), 0x5555u);
        cpu->power_state = DSPIC33_POWER_IDLE;
        expect(state, dspic33_device_advance(cpu, cycles),
               "master stopped idle advance");
        expect(state,
               (dspic33_read_word(cpu, base) & 1u) == 0u &&
                   (cpu->io.spi_busy & (uint8_t)(1u << channel)) == 0u,
               "master stopped idle aborts transfer");
    }
}

static void pmd_cases(SpiConformance* state, Dspic33* cpu) {
    uint8_t channel;
    for (channel = 0u; channel < DSPIC33_SPI_COUNT; channel++) {
        uint16_t base = bases[channel];
        uint16_t pmd_address = channel < 2u ? 0x0760u : 0x076au;
        uint16_t pmd_bit = channel < 2u ? (uint16_t)(0x0008u << channel)
                                        : (uint16_t)(1u << (channel - 2u));
        dspic33_reset(cpu, 0u);
        configure_spi(cpu, channel, 0x043bu, 0u, 0u);
        dspic33_write_word(cpu, pmd_address,
                           (uint16_t)(dspic33_read_word(cpu, pmd_address) | pmd_bit));
        dspic33_write_word(cpu, (uint16_t)(base + 8u), 0xaaaau);
        expect(state, (cpu->io.spi_busy & (uint8_t)(1u << channel)) == 0u,
               "pmd blocks transfer");
        dspic33_write_word(cpu, pmd_address,
                           (uint16_t)(dspic33_read_word(cpu, pmd_address) & ~pmd_bit));
        dspic33_write_word(cpu, (uint16_t)(base + 8u), 0xbbbbu);
        expect(state, (cpu->io.spi_busy & (uint8_t)(1u << channel)) != 0u,
               "pmd clear restores transfer");
    }
}

static void dma_cases(SpiConformance* state, Dspic33* cpu) {
    uint8_t channel;
    for (channel = 0u; channel < DSPIC33_SPI_COUNT; channel++) {
        uint16_t base = bases[channel];
        uint16_t control = 0x043bu;
        uint64_t cycles = transfer_cycles(control);
        uint16_t rx_memory = (uint16_t)(0x5000u + channel * 0x20u);
        uint16_t tx_memory = (uint16_t)(rx_memory + 0x10u);
        dspic33_reset(cpu, 0u);
        configure_spi(cpu, channel, control, 0u, 0u);
        configure_dma(cpu, 0u, 0x0001u, requests[channel], rx_memory,
                      (uint16_t)(base + 8u), 0u);
        expect(state, dspic33_spi_receive(cpu, channel, 0x6a00u + channel, cycles),
               "schedule dma receive response");
        dspic33_write_word(cpu, (uint16_t)(base + 8u), 0x1000u + channel);
        expect(state, dspic33_device_advance(cpu, cycles),
               "dma receive completion advance");
        expect(state, dspic33_read_word(cpu, rx_memory) == 0x6a00u + channel,
               "dma receive value");
        expect(state,
               (dspic33_read_word(cpu, dma_base(0u)) & 0x8000u) != 0u &&
                   !interrupt_flag(cpu, 4u) && cpu->io.dma_index[0] == 0u,
               "dma receive active before completion");
        expect(state, dspic33_device_advance(cpu, 1u),
               "dma receive controller completion advance");
        expect(state,
               (dspic33_read_word(cpu, dma_base(0u)) & 0x8000u) == 0u &&
                   interrupt_flag(cpu, 4u),
               "dma receive one shot complete");

        dspic33_reset(cpu, 0u);
        configure_spi(cpu, channel, control, 0u, 0u);
        dspic33_write_word(cpu, tx_memory, 0x7b00u + channel);
        configure_dma(cpu, 1u, 0x2001u, requests[channel], tx_memory,
                      (uint16_t)(base + 8u), 0u);
        dspic33_write_word(cpu, (uint16_t)(base + 8u), 0x2000u + channel);
        expect(state, dspic33_device_advance(cpu, cycles),
               "dma transmit request advance");
        expect(state, cpu->io.spi_shift[channel] == 0x7b00u + channel,
               "dma transmit loads next shift");
        expect(state,
               (dspic33_read_word(cpu, dma_base(1u)) & 0x8000u) != 0u &&
                   !interrupt_flag(cpu, 14u) && cpu->io.dma_index[1] == 0u,
               "dma transmit active before completion");
        expect(state, dspic33_device_advance(cpu, 1u),
               "dma transmit controller completion advance");
        expect(state,
               (dspic33_read_word(cpu, dma_base(1u)) & 0x8000u) == 0u &&
                   interrupt_flag(cpu, 14u),
               "dma transmit one shot complete");
        expect(state, dspic33_device_advance(cpu, cycles),
               "dma transmitted word completion");
        expect(state, cpu->io.spi_tx[channel].count == 4u,
               "dma transmit trace contains two words");

        dspic33_reset(cpu, 0u);
        configure_spi(cpu, channel, control, 0u, 0u);
        dspic33_write_word(cpu, tx_memory, 0x8c00u + channel);
        configure_dma(cpu, 0u, 0x0001u, requests[channel], rx_memory,
                      (uint16_t)(base + 8u), 0u);
        configure_dma(cpu, 1u, 0x2001u, requests[channel], tx_memory,
                      (uint16_t)(base + 8u), 0u);
        expect(state, dspic33_spi_receive(cpu, channel, 0x9d00u + channel, cycles),
               "schedule duplex dma response");
        dspic33_write_word(cpu, (uint16_t)(base + 8u), 0x3000u + channel);
        expect(state, dspic33_device_advance(cpu, cycles),
               "duplex dma completion advance");
        expect(state, dspic33_read_word(cpu, rx_memory) == 0x9d00u + channel,
               "duplex dma receive value");
        expect(state,
               cpu->io.spi_shift[channel] == 0x3000u + channel &&
                   cpu->io.dma_active == 1u,
               "duplex DMA receive channel has controller priority");
        expect(state, dspic33_device_advance(cpu, 1u),
               "duplex DMA receive completion and transmit start");
        expect(state, cpu->io.spi_shift[channel] == 0x8c00u + channel,
               "duplex dma transmit value");
    }
}

static void copy_and_reset_cases(SpiConformance* state, Dspic33* cpu, Dspic33* copy) {
    uint64_t cycles = transfer_cycles(0x043bu);
    dspic33_reset(cpu, 0u);
    dspic33_reset(copy, 0u);
    configure_spi(cpu, 0u, 0x043bu, 1u, 5u);
    dspic33_write_word(cpu, 0x0248u, 0xaaaau);
    dspic33_write_word(cpu, 0x0248u, 0xbbbbu);
    expect(state, dspic33_copy(copy, cpu), "copy spi state");
    expect(state,
           copy->io.spi_busy == cpu->io.spi_busy &&
               copy->io.spi_tx_fifo[0].count == cpu->io.spi_tx_fifo[0].count,
           "copied spi queues");
    expect(state, dspic33_device_advance(copy, cycles), "advance copied spi state");
    expect(state,
           copy->io.spi_rx_fifo[0].count == 1u && copy->io.spi_shift[0] == 0xbbbbu,
           "copied spi completes independently");
    expect(state, (dspic33_read_word(cpu, 0x0240u) & 1u) == 0u,
           "source spi remains pending");
    dspic33_reset(cpu, 0u);
    expect(state,
           cpu->io.spi_busy == 0u && cpu->io.spi_tx_fifo[0].count == 0u &&
               cpu->io.spi_rx_fifo[0].count == 0u,
           "reset clears spi state");
    expect(state,
           dspic33_read_word(cpu, 0x0240u) == 0u &&
               dspic33_read_word(cpu, 0x0248u) == 0u,
           "reset clears spi registers");
}

int main(void) {
    SpiConformance state = {0u, 0u, 0u};
    Dspic33 cpu;
    Dspic33 copy;
    bool initialized = dspic33_initialize(&cpu);
    bool copy_initialized = dspic33_initialize(&copy);
    expect(&state, initialized, "initialize SPI processor");
    expect(&state, copy_initialized, "initialize SPI copy");
    if (initialized && copy_initialized) {
        register_cases(&state, &cpu);
        split_buffer_cases(&state, &cpu);
        transmit_output_cases(&state, &cpu);
        receive_only_cases(&state, &cpu);
        physical_slave_input_cases(&state, &cpu, &copy);
        pps_slave_input_cases(&state, &cpu);
        master_output_cases(&state, &cpu, &copy);
        master_input_cases(&state, &cpu, &copy);
        timing_matrix_cases(&state, &cpu);
        standard_buffer_cases(&state, &cpu);
        enhanced_fifo_cases(&state, &cpu);
        interrupt_mode_cases(&state, &cpu);
        mode_transition_cases(&state, &cpu);
        selection_and_frame_cases(&state, &cpu);
        b1_frame_output_cases(&state, &cpu, &copy);
        master_frame_slave_cases(&state, &cpu);
        clock_and_power_cases(&state, &cpu);
        pmd_cases(&state, &cpu);
        dma_cases(&state, &cpu);
        copy_and_reset_cases(&state, &cpu, &copy);
    }
    expect(&state, state.cases == 3349u, "SPI assertion accounting");
    if (copy_initialized) {
        dspic33_destroy(&copy);
    }
    if (initialized) {
        dspic33_destroy(&cpu);
    }
    report_sfr_side_effect_coverage(
        "spi", spi_sfr_side_effect_coverage,
        SFR_SIDE_EFFECT_COVERAGE_COUNT(spi_sfr_side_effect_coverage),
        state.failed == 0u);
    printf("[spi-summary] cases=%" PRIu32 " passed=%" PRIu32 " failed=%" PRIu32 "\n",
           state.cases, state.passed, state.failed);
    return state.failed == 0u ? 0 : 1;
}
